src/cf/Catalogs/узСтатусыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Catalog>
		<Properties>
			<Name>узСтатусыЗадачи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узВидыСтатусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьЗадачиДляДанногоСтатусаВФормеСписка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьWIPЛимит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьWIPЛимитНаИсполнителя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WIPЛимитУказываетсяВРодителе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WIPЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляКанбанДоски</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Наблюдатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/узСтатусыЗадачи/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	ИзменитьУПодчиненныхЭлементовРеквизиты();
	
КонецПроцедуры

Процедура ИзменитьУПодчиненныхЭлементовРеквизиты()
	
	Если НЕ ДополнительныеСвойства.ИзмененWIPЛимит Тогда
		Возврат;
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	узСтатусыЗадачи.Ссылка
	|ИЗ
	|	Справочник.узСтатусыЗадачи КАК узСтатусыЗадачи
	|ГДЕ
	|	узСтатусыЗадачи.Ссылка <> &Ссылка
	|	И узСтатусыЗадачи.Ссылка В ИЕРАРХИИ(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	Конецесли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		#Если Тромбон тогда
			СпрОбъект = Справочники.узСтатусыЗадачи.СоздатьЭлемент();
		#Конецесли
		
		СпрОбъект.WIPЛимит = WIPЛимит;
		СпрОбъект.ИспользоватьWIPЛимит = ИспользоватьWIPЛимит;
		СпрОбъект.ИспользоватьWIPЛимитНаИсполнителя = ИспользоватьWIPЛимитНаИсполнителя;
		СпрОбъект.WIPЛимитУказываетсяВРодителе = ИспользоватьWIPЛимит;
		
		СпрОбъект.Записать();
	КонецЦикла;
	

КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.Уровень() > 1 Тогда
		ВызватьИсключение "Ошибка! в данный момент не реализовано использования больше 2 уровней вложенности элементов";
		//В канбан доске заголовки надо получать рекурсией
		//При получении количество задач в статусе надо учитывать вложенность, тоже рекурсией как то получать
		
	Конецесли;
	
	ИзмененWIPЛимит = Ложь;
	Если НЕ ЭтоНовый() Тогда
		Если ИспользоватьWIPЛимит = Ссылка.ИспользоватьWIPЛимит
			И ИспользоватьWIPЛимитНаИсполнителя = Ссылка.ИспользоватьWIPЛимитНаИсполнителя
			И WIPЛимит = Ссылка.WIPЛимит Тогда
		Иначе
			ИзмененWIPЛимит = Истина;
		Конецесли;
	Конецесли;	
	ДополнительныеСвойства.Вставить("ИзмененWIPЛимит",ИзмененWIPЛимит);	
		
КонецПроцедуры
